In [1]:
import pandas as pd

In [ ]:
from pivottablejs import pivot_ui

In [ ]:
df = pd.read_csv('Sample.csv')
pivot_ui(df)

In [87]:
df = pd.read_csv('trans_six_months.csv')

In [4]:
df.head()

,account_id,date_trans,type,operation,amount,date_loan,status,days
0,10001,1996-01-14,credit,withdrawal_in_cash,500.0,1996-07-11,0.0,179
1,10001,1996-01-17,credit,withdrawal_in_cash,5700.0,1996-07-11,0.0,176
2,10001,1996-01-23,credit,withdrawal_in_cash,8500.0,1996-07-11,0.0,170
3,10001,1996-01-26,credit,withdrawal_in_cash,2500.0,1996-07-11,0.0,167
4,10001,1996-01-29,credit,withdrawal_in_cash,1900.0,1996-07-11,0.0,164

In [5]:
df['type'].value_counts()

credit        16360
withdrawal     9722
VYBER           920
Name: type, dtype: int64

In [6]:
df.dtypes

account_id      int64
date_trans     object
type           object
operation      object
amount        float64
date_loan      object
status        float64
days            int64
dtype: object

In [7]:
df.account_id = df.account_id.apply(lambda x: str(x))

In [8]:
df.dtypes

account_id     object
date_trans     object
type           object
operation      object
amount        float64
date_loan      object
status        float64
days            int64
dtype: object

In [28]:
a = pd.DataFrame(df.groupby(['account_id', 'type', 'operation'])['amount'].sum())

In [55]:
a_count = pd.DataFrame(df.groupby(['account_id', 'type', 'operation']).count())

In [59]:
a_count.columns

Index(['date_trans', 'amount', 'date_loan', 'status', 'days'], dtype='object')

In [64]:
a_count.reset_index(inplace = True)

In [69]:
a_count.operation.value_counts()

withdrawal_in_cash              1012
other                            679
credit_in_cash                   570
remittance_to_another_bank       407
collection_from_another_bank     210
credit_card_withdrawal            22
Name: operation, dtype: int64

In [107]:
df.columns

Index(['account_id', 'date_trans', 'type', 'operation', 'amount', 'date_loan',
       'status', 'days'],
      dtype='object')

In [117]:
df[df.operation == 'other'].head()

,account_id,date_trans,type,operation,amount,date_loan,status,days
5,10001,1996-01-31,withdrawal,other,189.3,1996-07-11,0.0,162
10,10001,1996-02-29,withdrawal,other,155.2,1996-07-11,0.0,133
15,10001,1996-03-31,withdrawal,other,187.6,1996-07-11,0.0,102
21,10001,1996-04-30,withdrawal,other,201.9,1996-07-11,0.0,72
27,10001,1996-05-31,withdrawal,other,186.5,1996-07-11,0.0,41

In [120]:
df['type'][df['operation']=='other'].nunique()

1

# Rename the operations

withdrawal_in_cash -> as it is
other -> Doubt (After analysis other is only withdrawl)
credit_in_cash -> as it is
remittance_to_another_bank -> withdrawal_to_another_bank
collection_from_another_bank -> credit_from_another_bank
credit_card_withdrawal -> withdrawal_by_credit_card

In [90]:
#### Aggregate on the basis of the operation vs ampunt
table_oper_amount = (pd.pivot_table(df, values='amount', index=['account_id'],columns=['operation'],
                         aggfunc=np.sum)).reset_index()

In [98]:
table_oper_amount[table_oper_amount.account_id == 10001]

operation,account_id,collection_from_another_bank,credit_card_withdrawal,credit_in_cash,other,remittance_to_another_bank,withdrawal_in_cash
592,10001,NaN,NaN,104546.0,1076.4,NaN,108587.6

In [101]:
### Drop the duplicate row on the basis of the status
table_status = df[['account_id', 'status']].drop_duplicates(subset='account_id', keep='last')

In [103]:
table_status.head()

     account_id  status
35        10001     0.0
68        10005     0.0
94        10019     0.0
127       10022     0.0
182        1004     0.0

In [104]:
### Merge the table table_status and table_oper_amount
trans_loan_final = pd.merge(table_oper_amount,table_status,on="account_id",how="left")

In [106]:
trans_loan_final.head()

operation,account_id,collection_from_another_bank,credit_card_withdrawal,credit_in_cash,other,remittance_to_another_bank,withdrawal_in_cash,status
0,2,131534.0,NaN,NaN,861.7,36330.0,113514.6,0.0
1,19,98403.0,NaN,17800.0,770.4,NaN,121373.0,1.0
2,25,NaN,NaN,250065.0,1585.7,41565.0,243365.6,0.0
3,37,NaN,NaN,151468.0,705.9,29988.0,134292.0,1.0
4,38,89967.0,NaN,8100.0,937.8,29671.0,78616.0,0.0

In [71]:
table_oper_amount.head()

operation,account_id,collection_from_another_bank,credit_card_withdrawal,credit_in_cash,other,remittance_to_another_bank,withdrawal_in_cash
0,10001,NaN,NaN,104546.0,1076.4,NaN,108587.6
1,10005,228313.0,NaN,NaN,1309.0,36604.0,210474.8
2,10019,NaN,NaN,76936.0,678.2,NaN,57687.6
3,10022,149908.0,NaN,NaN,1460.1,35346.0,118688.8
4,1004,NaN,NaN,410729.0,1385.1,NaN,437710.6

In [68]:
a_count.head()

,account_id,type,operation,date_trans,amount,date_loan,status,days
0,10001,credit,withdrawal_in_cash,24,24,24,24,24
1,10001,withdrawal,credit_in_cash,6,6,6,6,6
2,10001,withdrawal,other,6,6,6,6,6
3,10005,VYBER,withdrawal_in_cash,1,1,1,1,1
4,10005,credit,remittance_to_another_bank,4,4,4,4,4

In [29]:
type(a)

pandas.core.frame.DataFrame

In [34]:
a.reset_index()

     account_id        type                     operation    amount
0         10001      credit            withdrawal_in_cash  108587.6
1         10001  withdrawal                credit_in_cash  104546.0
2         10001  withdrawal                         other    1076.4
3         10005       VYBER            withdrawal_in_cash   10631.0
4         10005      credit    remittance_to_another_bank   36604.0
5         10005      credit            withdrawal_in_cash  199843.8
6         10005  withdrawal  collection_from_another_bank  228313.0
7         10005  withdrawal                         other    1309.0
8         10019      credit            withdrawal_in_cash   57687.6
9         10019  withdrawal                credit_in_cash   76936.0
10        10019  withdrawal                         other     678.2
11        10022       VYBER            withdrawal_in_cash   30245.0
12        10022      credit    remittance_to_another_bank   35346.0
13        10022      credit            withdrawal_in_cash   88443.8
14        10022  withdrawal  collection_from_another_bank  149908.0
15        10022  withdrawal                         other    1460.1
16         1004       VYBER            withdrawal_in_cash   29723.0
17         1004      credit            withdrawal_in_cash  407987.6
18         1004  withdrawal                credit_in_cash  410729.0
19         1004  withdrawal                         other    1385.1
20        10049      credit    remittance_to_another_bank   17340.0
21        10049      credit            withdrawal_in_cash   57207.6
22        10049  withdrawal                credit_in_cash   65677.0
23        10049  withdrawal                         other     436.4
24        10063      credit    remittance_to_another_bank   47052.0
25        10063      credit            withdrawal_in_cash  225290.0
26        10063  withdrawal  collection_from_another_bank  252863.0
27        10063  withdrawal                credit_in_cash    4200.0
28        10063  withdrawal                         other    1287.5
29        10065       VYBER            withdrawal_in_cash   41180.0
...         ...         ...                           ...       ...
2870       9828  withdrawal                         other     987.8
2871       9833       VYBER            withdrawal_in_cash   41885.0
2872       9833      credit    remittance_to_another_bank   74676.0
2873       9833      credit            withdrawal_in_cash  206973.0
2874       9833  withdrawal  collection_from_another_bank  317304.0
2875       9833  withdrawal                         other    1128.2
2876       9859       VYBER            withdrawal_in_cash   29311.0
2877       9859      credit        credit_card_withdrawal    3000.0
2878       9859      credit    remittance_to_another_bank   19494.0
2879       9859      credit            withdrawal_in_cash  125587.6
2880       9859  withdrawal  collection_from_another_bank  195409.0
2881       9859  withdrawal                         other    1362.0
2882       9869      credit    remittance_to_another_bank   50310.0
2883       9869      credit            withdrawal_in_cash   84207.6
2884       9869  withdrawal                credit_in_cash  144796.0
2885       9869  withdrawal                         other     949.7
2886       9897       VYBER            withdrawal_in_cash    3081.0
2887       9897      credit    remittance_to_another_bank   36890.0
2888       9897      credit            withdrawal_in_cash   70229.2
2889       9897  withdrawal  collection_from_another_bank  117527.0
2890       9897  withdrawal                credit_in_cash    2400.0
2891       9897  withdrawal                         other    1030.2
2892       9928      credit    remittance_to_another_bank   25080.0
2893       9928      credit            withdrawal_in_cash   51333.0
2894       9928  withdrawal                credit_in_cash   75023.0
2895       9928  withdrawal                         other    1109.7
2896        993       VYBER            withdrawal_in_cash   32928.0
2897        993      credit            withdrawal_in_cash  173673.0
2898        993  withdrawal                credit_in_cash  216247.0
2899        993  withdrawal                         other    1567.0

[2900 rows x 4 columns]

In [36]:
a.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 2900 entries, (10001, credit, withdrawal_in_cash) to (993, withdrawal, other)
Data columns (total 1 columns):
amount    2900 non-null float64
dtypes: float64(1)
memory usage: 45.3+ KB

In [43]:
df.h

,account_id,date_trans,type,operation,amount,date_loan,status,days
0,10001,1996-01-14,credit,withdrawal_in_cash,500.0,1996-07-11,0.0,179
1,10001,1996-01-17,credit,withdrawal_in_cash,5700.0,1996-07-11,0.0,176
2,10001,1996-01-23,credit,withdrawal_in_cash,8500.0,1996-07-11,0.0,170
3,10001,1996-01-26,credit,withdrawal_in_cash,2500.0,1996-07-11,0.0,167
4,10001,1996-01-29,credit,withdrawal_in_cash,1900.0,1996-07-11,0.0,164

In [44]:
df.reset_index()

,index,account_id,date_trans,type,operation,amount,date_loan,status,days
0,0,10001,1996-01-14,credit,withdrawal_in_cash,500.0,1996-07-11,0.0,179
1,1,10001,1996-01-17,credit,withdrawal_in_cash,5700.0,1996-07-11,0.0,176
2,2,10001,1996-01-23,credit,withdrawal_in_cash,8500.0,1996-07-11,0.0,170
3,3,10001,1996-01-26,credit,withdrawal_in_cash,2500.0,1996-07-11,0.0,167
4,4,10001,1996-01-29,credit,withdrawal_in_cash,1900.0,1996-07-11,0.0,164
5,5,10001,1996-01-31,withdrawal,other,189.3,1996-07-11,0.0,162
6,6,10001,1996-01-31,credit,withdrawal_in_cash,14.6,1996-07-11,0.0,162
7,7,10001,1996-02-06,withdrawal,credit_in_cash,16084.0,1996-07-11,0.0,156
8,8,10001,1996-02-17,credit,withdrawal_in_cash,500.0,1996-07-11,0.0,145
9,9,10001,1996-02-22,credit,withdrawal_in_cash,14300.0,1996-07-11,0.0,140
10,10,10001,1996-02-29,withdrawal,other,155.2,1996-07-11,0.0,133
11,11,10001,1996-02-29,credit,withdrawal_in_cash,14.6,1996-07-11,0.0,133
12,12,10001,1996-03-06,withdrawal,credit_in_cash,16084.0,1996-07-11,0.0,127
13,13,10001,1996-03-07,credit,withdrawal_in_cash,500.0,1996-07-11,0.0,126
14,14,10001,1996-03-23,credit,withdrawal_in_cash,11000.0,1996-07-11,0.0,110
15,15,10001,1996-03-31,withdrawal,other,187.6,1996-07-11,0.0,102
16,16,10001,1996-03-31,credit,withdrawal_in_cash,14.6,1996-07-11,0.0,102
17,17,10001,1996-04-06,withdrawal,credit_in_cash,16084.0,1996-07-11,0.0,96
18,18,10001,1996-04-07,credit,withdrawal_in_cash,400.0,1996-07-11,0.0,95
19,19,10001,1996-04-22,credit,withdrawal_in_cash,13200.0,1996-07-11,0.0,80
20,20,10001,1996-04-27,credit,withdrawal_in_cash,3900.0,1996-07-11,0.0,75
21,21,10001,1996-04-30,withdrawal,other,201.9,1996-07-11,0.0,72
22,22,10001,1996-04-30,credit,withdrawal_in_cash,14.6,1996-07-11,0.0,72
23,23,10001,1996-05-06,withdrawal,credit_in_cash,16084.0,1996-07-11,0.0,66
24,24,10001,1996-05-08,credit,withdrawal_in_cash,2600.0,1996-07-11,0.0,64
25,25,10001,1996-05-11,credit,withdrawal_in_cash,500.0,1996-07-11,0.0,61
26,26,10001,1996-05-22,credit,withdrawal_in_cash,13900.0,1996-07-11,0.0,50
27,27,10001,1996-05-31,withdrawal,other,186.5,1996-07-11,0.0,41
28,28,10001,1996-05-31,credit,withdrawal_in_cash,14.6,1996-07-11,0.0,41
29,29,10001,1996-06-06,withdrawal,credit_in_cash,24126.0,1996-07-11,0.0,35
...,...,...,...,...,...,...,...,...,...
26972,26972,993,1998-02-04,credit,withdrawal_in_cash,48400.0,1998-07-01,0.0,147
26973,26973,993,1998-02-04,withdrawal,credit_in_cash,47615.0,1998-07-01,0.0,147
26974,26974,993,1998-02-07,credit,withdrawal_in_cash,13300.0,1998-07-01,0.0,144
26975,26975,993,1998-02-12,credit,withdrawal_in_cash,1800.0,1998-07-01,0.0,139
26976,26976,993,1998-02-20,withdrawal,credit_in_cash,39084.0,1998-07-01,0.0,131
26977,26977,993,1998-02-28,withdrawal,other,274.1,1998-07-01,0.0,123
26978,26978,993,1998-02-28,credit,withdrawal_in_cash,14.6,1998-07-01,0.0,123
26979,26979,993,1998-03-08,VYBER,withdrawal_in_cash,5121.0,1998-07-01,0.0,115
26980,26980,993,1998-03-09,credit,withdrawal_in_cash,25600.0,1998-07-01,0.0,114
26981,26981,993,1998-03-11,credit,withdrawal_in_cash,2300.0,1998-07-01,0.0,112
26982,26982,993,1998-03-31,withdrawal,other,263.8,1998-07-01,0.0,92
26983,26983,993,1998-03-31,credit,withdrawal_in_cash,14.6,1998-07-01,0.0,92
26984,26984,993,1998-04-08,credit,withdrawal_in_cash,13300.0,1998-07-01,0.0,84
26985,26985,993,1998-04-14,credit,withdrawal_in_cash,1700.0,1998-07-01,0.0,78
26986,26986,993,1998-04-30,withdrawal,other,193.2,1998-07-01,0.0,62
26987,26987,993,1998-04-30,credit,withdrawal_in_cash,14.6,1998-07-01,0.0,62
26988,26988,993,1998-05-02,withdrawal,credit_in_cash,32018.0,1998-07-01,0.0,60
26989,26989,993,1998-05-04,credit,withdrawal_in_cash,2000.0,1998-07-01,0.0,58
26990,26990,993,1998-05-08,credit,withdrawal_in_cash,24800.0,1998-07-01,0.0,54
26991,26991,993,1998-05-18,withdrawal,credit_in_cash,23812.0,1998-07-01,0.0,44
26992,26992,993,1998-05-22,withdrawal,credit_in_cash,10245.0,1998-07-01,0.0,40
26993,26993,993,1998-05-31,withdrawal,other,257.1,1998-07-01,0.0,31
26994,26994,993,1998-05-31,VYBER,withdrawal_in_cash,9297.0,1998-07-01,0.0,31
26995,26995,993,1998-05-31,credit,withdrawal_in_cash,14.6,1998-07-01,0.0,31
26996,26996,993,1998-06-07,credit,withdrawal_in_cash,39200.0,1998-07-01,0.0,24
26997,26997,993,1998-06-07,withdrawal,credit_in_cash,28918.0,1998-07-01,0.0,24
26998,26998,993,1998-06-10,credit,withdrawal_in_cash,1200.0,1998-07-01,0.0,21
26999,26999,993,1998-06-28,VYBER,withdrawal_in_cash,18510.0,1998-07-01,0.0,3
27000,27000,993,1998-06-30,withdrawal,other,263.5,1998-07-01,0.0,1
27001,27001,993,1998-06-30,credit,withdrawal_in_cash,14.6,1998-07-01,0.0,1

In [45]:
df.columns

Index(['account_id', 'date_trans', 'type', 'operation', 'amount', 'date_loan',
       'status', 'days'],
      dtype='object')

In [46]:
b = df.pivot(index = 'account_id', columns='type',values='amount')

ValueError: Index contains duplicate entries, cannot reshape

In [15]:
df.dtypes

account_id     object
date_trans     object
type           object
operation      object
amount        float64
date_loan      object
status        float64
days            int64
dtype: object

In [17]:
import numpy as np

In [33]:
a.dtypes

amount    float64
dtype: object

In [18]:
table1 = (pd.pivot_table(df, values='amount', index=['account_id'],columns=['type'],
                         aggfunc=np.sum)).reset_index()

In [19]:
type(table1)

pandas.core.frame.DataFrame

In [21]:
table1.head()

type account_id    VYBER    credit  withdrawal
0         10001      NaN  108587.6    105622.4
1         10005  10631.0  236447.8    229622.0
2         10019      NaN   57687.6     77614.2
3         10022  30245.0  123789.8    151368.1
4          1004  29723.0  407987.6    412114.1

In [31]:
table2 = (pd.pivot_table(df, index = 'account_id', columns= 'operation', values = 'amount',
                        aggfunc = np.sum)).reset_index()

In [32]:
table2

operation,account_id,collection_from_another_bank,credit_card_withdrawal,credit_in_cash,other,remittance_to_another_bank,withdrawal_in_cash
0,10001,NaN,NaN,104546.0,1076.4,NaN,108587.6
1,10005,228313.0,NaN,NaN,1309.0,36604.0,210474.8
2,10019,NaN,NaN,76936.0,678.2,NaN,57687.6
3,10022,149908.0,NaN,NaN,1460.1,35346.0,118688.8
4,1004,NaN,NaN,410729.0,1385.1,NaN,437710.6
5,10049,NaN,NaN,65677.0,436.4,17340.0,57207.6
6,10063,252863.0,NaN,4200.0,1287.5,47052.0,225290.0
7,10065,NaN,NaN,296720.0,1345.8,NaN,274467.6
8,10068,NaN,NaN,167511.0,931.2,NaN,110743.8
9,10079,NaN,NaN,254150.0,1456.3,NaN,263916.6
10,10093,262451.0,NaN,NaN,1114.9,61050.0,206096.0
11,10105,NaN,NaN,350303.0,1467.0,NaN,363001.6
12,1011,132619.0,NaN,NaN,919.6,42510.0,98423.6
13,1012,98180.0,NaN,500.0,976.2,NaN,30700.0
14,10131,NaN,NaN,60470.0,692.9,NaN,30500.0
15,10134,NaN,NaN,323980.0,1586.9,57210.0,274287.6
16,10148,NaN,NaN,87802.0,1118.8,36426.0,54987.6
17,10202,NaN,NaN,52651.0,715.4,36966.0,75287.6
18,10215,NaN,NaN,93021.0,1115.1,25644.0,66373.0
19,10233,155441.0,NaN,NaN,873.5,34530.0,128709.6
20,10243,NaN,NaN,446374.0,1363.2,NaN,370106.6
21,10257,NaN,NaN,358421.0,1387.1,74005.0,238147.6
22,10266,NaN,NaN,143095.0,1777.0,NaN,133200.0
23,10280,226291.0,NaN,NaN,1059.1,NaN,205999.0
24,10297,NaN,NaN,138275.0,932.2,59412.0,89253.0
25,103,NaN,NaN,138085.0,1649.8,NaN,163383.1
26,10320,142852.0,NaN,800.0,781.5,12414.0,64800.0
27,10345,NaN,NaN,66741.0,541.5,40452.0,37147.6
28,10351,NaN,NaN,46204.0,368.0,26460.0,25487.6
29,10361,282360.0,NaN,NaN,1297.5,NaN,286520.6
...,...,...,...,...,...,...,...
652,9504,241053.0,8100.0,NaN,1211.3,NaN,231627.6
653,9510,NaN,NaN,97883.0,839.6,NaN,45014.6
654,9513,NaN,NaN,132119.0,684.0,49914.0,86347.6
655,9548,NaN,NaN,91645.0,593.1,9613.0,43900.0
656,9560,NaN,NaN,102760.0,2017.6,NaN,88200.0
657,9583,NaN,NaN,281114.0,1528.5,80316.0,216789.0
658,9591,NaN,NaN,175049.0,1020.0,24876.0,168970.6
659,960,260071.0,NaN,NaN,1692.5,17820.0,215209.0
660,9627,NaN,NaN,379453.0,1727.2,NaN,344404.0
661,9631,96597.0,NaN,13000.0,537.5,NaN,100423.6
662,9633,NaN,NaN,199121.0,1230.9,NaN,170456.2
663,9640,105083.0,NaN,10400.0,739.2,88104.0,57229.6
664,9645,139524.0,NaN,1100.0,568.7,NaN,87600.0
665,9646,NaN,NaN,308477.0,1344.3,NaN,335346.0
666,9656,NaN,NaN,417161.0,1923.8,64326.0,367388.6
667,9673,95557.0,NaN,8500.0,948.7,22104.0,62968.6
668,9677,NaN,NaN,88543.0,653.0,35776.0,57143.8
669,97,NaN,NaN,119132.0,737.1,21754.0,75907.6
670,9730,NaN,NaN,69511.0,739.8,20088.0,42623.8
671,9731,123266.0,NaN,700.0,843.7,37722.0,93846.0
672,9750,NaN,NaN,142982.0,1433.1,NaN,173711.2
673,9790,NaN,NaN,307048.0,979.3,76146.0,216383.6
674,9814,NaN,NaN,115901.0,2853.4,NaN,143824.0
675,9828,205712.0,NaN,NaN,987.8,NaN,207625.6
676,9833,317304.0,NaN,NaN,1128.2,74676.0,248858.0
677,9859,195409.0,3000.0,NaN,1362.0,19494.0,154898.6
678,9869,NaN,NaN,144796.0,949.7,50310.0,84207.6
679,9897,117527.0,NaN,2400.0,1030.2,36890.0,73310.2
680,9928,NaN,NaN,75023.0,1109.7,25080.0,51333.0
681,993,NaN,NaN,216247.0,1567.0,NaN,206601.0